Using_perl6/0_Preface.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>1: Preface</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="1: Preface"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-05-10T11:27+0800"/>
<meta name="author" content="GRC(扬眉剑)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">1: Preface</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 github地址</a></li>
<li><a href="#sec-2">2 第一章：前言</a>
<ul>
<li><a href="#sec-2-1">2.1 1.1 Audience 读者人群</a></li>
<li><a href="#sec-2-2">2.2 1.2 本书的结构</a></li>
<li><a href="#sec-2-3">2.3 1.3 Perl6和Perl5的关系</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> github地址</h2>
<div class="outline-text-2" id="text-1">

<p><a href="https://github.com/gaorongchao/Perl6/tree/master/Using_perl6">https://github.com/gaorongchao/Perl6/tree/master/Using_perl6</a>
</p>
<p>
所有后续更新都在github上进行，其他地方不做同步。
发现任何错误，或者不当的地方，请先到github查看是否改正。
如果没有请留言。或者邮件交流：rongchaogao@gmail.com
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 第一章：前言</h2>
<div class="outline-text-2" id="text-2">

<p>Perl6是这样一门编程语言，在整个程序的完整周期中，在各个不同的
阶段有着不同的编译器和解释器。
这些东西的实现又反过来影响了这门语言的设计，
帮助发现那些性能不足、矛盾或者难以实现且得不偿失的特性。
(by highlighting misfeatures,contradictions,or features
of difficult implementation and little benefit)
这门语言通过反复的改进，成为一个衔接顺畅且统一的规范语言。
（翻译待改善）。
</p>
<p>
Perl6是一门通用，直观灵活的语言。它融合了如程序化（procedural），
面向对象，和函数式编程等众多范式；同时也为文本解析提供了强大的工具。
</p>
<p>
这本书正在书写中。已经发布的版本中依然包许多TODO的注释，这些是我们在
正式刊印本书前要做的。我们保留TODO是因为他们可以为读者和我们提供一个有用
的提示，让我们知道那些地方需要改善和完成。
尽管如此，我们仍然要祈求读者的宽容和理解。
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 1.1 Audience 读者人群</h3>
<div class="outline-text-3" id="text-2-1">

<p>这本书主要是为那些想学习Perl6的人准备的。
它只是一系列的学习指南，而不是综合的参考手册。
尽快不要求对Perl有一定的认识，但是我们依然希望读者能够有一些使用其他编程语言的
经验。
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 1.2 本书的结构</h3>
<div class="outline-text-3" id="text-2-2">

<p>每一章以一个合理而完整的例子来阐述本章的主题。
我们希望通过解释每一章中真实的程序，能够通过这些例子来展现如何使用这些特色，技巧和惯用语。
我们的目标是把Perl6的特点在程序中表现出来，这样读者就可以自己写出地道的Perl6程序，
而不是写出像其它语言的程序。
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 1.3 Perl6和Perl5的关系</h3>
<div class="outline-text-3" id="text-2-3">

<p>Perl6是Perl大家族中新的一员。
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-05-10T11:27+0800</p>
<p class="author">Author: GRC(扬眉剑)</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
