Using_perl6/0_Preface.tex
% Created 2014-05-10 Sat 11:27
\documentclass{ctexart}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\usepackage{listings}
\usepackage{color}
\usepackage{xcolor}
\definecolor{background}{rgb}{0.9,0.9,0.9}
\tolerance=1000

\providecommand{\alert}[1]{\textbf{#1}}

\title{1: Preface}
\author{GRC(扬眉剑)}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}
\section{github地址}
\label{sec-1}

\href{https://github.com/gaorongchao/Perl6/tree/master/Using_perl6}{https://github.com/gaorongchao/Perl6/tree/master/Using\_perl6}

所有后续更新都在github上进行，其他地方不做同步。
发现任何错误，或者不当的地方，请先到github查看是否改正。
如果没有请留言。或者邮件交流：rongchaogao@gmail.com
\section{第一章：前言}
\label{sec-2}

Perl6是这样一门编程语言，在整个程序的完整周期中，在各个不同的
阶段有着不同的编译器和解释器。
这些东西的实现又反过来影响了这门语言的设计，
帮助发现那些性能不足、矛盾或者难以实现且得不偿失的特性。
(by highlighting misfeatures,contradictions,or features
of difficult implementation and little benefit)
这门语言通过反复的改进，成为一个衔接顺畅且统一的规范语言。
（翻译待改善）。

Perl6是一门通用，直观灵活的语言。它融合了如程序化（procedural），
面向对象，和函数式编程等众多范式；同时也为文本解析提供了强大的工具。

这本书正在书写中。已经发布的版本中依然包许多TODO的注释，这些是我们在
正式刊印本书前要做的。我们保留TODO是因为他们可以为读者和我们提供一个有用
的提示，让我们知道那些地方需要改善和完成。
尽管如此，我们仍然要祈求读者的宽容和理解。
\subsection{1.1 Audience 读者人群}
\label{sec-2-1}

这本书主要是为那些想学习Perl6的人准备的。
它只是一系列的学习指南，而不是综合的参考手册。
尽快不要求对Perl有一定的认识，但是我们依然希望读者能够有一些使用其他编程语言的
经验。
\subsection{1.2 本书的结构}
\label{sec-2-2}

每一章以一个合理而完整的例子来阐述本章的主题。
我们希望通过解释每一章中真实的程序，能够通过这些例子来展现如何使用这些特色，技巧和惯用语。
我们的目标是把Perl6的特点在程序中表现出来，这样读者就可以自己写出地道的Perl6程序，
而不是写出像其它语言的程序。
\subsection{1.3 Perl6和Perl5的关系}
\label{sec-2-3}

Perl6是Perl大家族中新的一员。

\end{document}
